# 출석첵

# 1. dict 2 series

In [1]:
import pandas as pd

In [2]:
dic_1 = {'a':1, 'b':2 ,'c':3}

In [5]:
ser_1 = pd.Series(dic_1)

In [6]:
ser_1

a    1
b    2
c    3
dtype: int64

In [7]:
type(ser_1)

pandas.core.series.Series

In [8]:
list_1 = ['hello world', 231, 111.1111, True]

In [9]:
ser_2 = pd.Series(list_1)

In [10]:
ser_2

0    hello world
1            231
2        111.111
3           True
dtype: object

In [11]:
ser_2.index

RangeIndex(start=0, stop=4, step=1)

In [12]:
ser_1.index

Index(['a', 'b', 'c'], dtype='object')

In [13]:
ser_1.values

array([1, 2, 3], dtype=int64)

In [14]:
ser_2.values

array(['hello world', 231, 111.1111, True], dtype=object)

In [15]:
tup_1 = ('hello world', 231, 111.1111, True)

In [17]:
ser_3 = pd.Series(tup_1)

In [18]:
ser_3

0    hello world
1            231
2        111.111
3           True
dtype: object

In [19]:
ser_4 = pd.Series(tup_1, index=('헬로','월드','집에','가고싶다'))

In [20]:
ser_4

헬로      hello world
월드              231
집에          111.111
가고싶다           True
dtype: object

In [21]:
ser_4[0]

'hello world'

In [22]:
ser_4[0:2]

헬로    hello world
월드            231
dtype: object

# 2차원 배열

In [24]:
dic_2 = {'a': [1,2,3], 'b':[4,5,6], 'c':[7,8,9]}

In [25]:
df_1 = pd.DataFrame(dic_2)

In [26]:
df_1

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [29]:
type(df_1)

pandas.core.frame.DataFrame

In [27]:
ser_4 = pd.Series(dic_2)

In [28]:
ser_4

a    [1, 2, 3]
b    [4, 5, 6]
c    [7, 8, 9]
dtype: object

In [30]:
import pandas as pd

exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])

In [5]:
exam_data = {'이름' : [ '서준', '우현', '인아'],
             '수학' : [ 90, 80, 70],
             '영어' : [ 98, 89, 95],
             '음악' : [ 85, 95, 100],
             '체육' : [ 100, 90, 90]}

In [4]:
import pandas as pd

In [6]:
df_5 = pd.DataFrame(exam_data)

In [9]:
df_5['수학']

0    90
1    80
2    70
Name: 수학, dtype: int64

In [12]:
df_5.수학

0    90
1    80
2    70
Name: 수학, dtype: int64

In [15]:
df_5[['수학','영어']]

   수학  영어
0  90  98
1  80  89
2  70  95

In [18]:
df_5

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [21]:
df_5.set_index('이름',inplace=True)

In [22]:
df_5

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [23]:
df_5.loc['서준','음악']

85

In [25]:
df_5.loc['서준',['음악','수학']]

음악    85
수학    90
Name: 서준, dtype: int64

In [26]:
df_6 = pd.DataFrame(exam_data)

In [29]:
df_6['국어'] = 10

In [30]:
df_6

   이름  수학  영어   음악   체육  국어
0  서준  90  98   85  100  10
1  우현  80  89   95   90  10
2  인아  70  95  100   90  10

In [31]:
df_6['과학'] = [10,20,30]

In [32]:
df_6

   이름  수학  영어   음악   체육  국어  과학
0  서준  90  98   85  100  10  10
1  우현  80  89   95   90  10  20
2  인아  70  95  100   90  10  30

In [34]:
df_6.loc[3] = 10

In [35]:
df_6

   이름  수학  영어   음악   체육  국어  과학
0  서준  90  98   85  100  10  10
1  우현  80  89   95   90  10  20
2  인아  70  95  100   90  10  30
3  10  10  10   10   10  10  10

In [36]:
df_6.loc[4] = ['민엽',90,30,80,100,20,90]

In [37]:
df_6

   이름  수학  영어   음악   체육  국어  과학
0  서준  90  98   85  100  10  10
1  우현  80  89   95   90  10  20
2  인아  70  95  100   90  10  30
3  10  10  10   10   10  10  10
4  민엽  90  30   80  100  20  90

In [40]:
df_6.loc[3] = 0

In [41]:
df_6

   이름  수학  영어   음악   체육  국어  과학
0  서준  90  98   85  100  10  10
1  우현  80  89   95   90  10  20
2  인아  70  95  100   90  10  30
3   0   0   0    0    0   0   0
4  민엽  90  30   80  100  20  90

In [43]:
df_6.loc['규희'] = [100,100,100,100,90,90,80]

In [44]:
df_6

     이름   수학   영어   음악   체육  국어  과학
0    서준   90   98   85  100  10  10
1    우현   80   89   95   90  10  20
2    인아   70   95  100   90  10  30
3     0    0    0    0    0   0   0
4    민엽   90   30   80  100  20  90
규희  100  100  100  100   90  90  80

In [50]:
df_6.loc[4]

이름     민엽
수학     90
영어     30
음악     80
체육    100
국어     20
과학     90
Name: 4, dtype: object

In [51]:
df_6.loc['규희']

이름    100
수학    100
영어    100
음악    100
체육     90
국어     90
과학     80
Name: 규희, dtype: object

In [56]:
df_6.drop([3],inplace=True)

In [57]:
df_6.drop(['규희'],inplace=True)

In [58]:
df_6

   이름  수학  영어   음악   체육  국어  과학
0  서준  90  98   85  100  10  10
1  우현  80  89   95   90  10  20
2  인아  70  95  100   90  10  30
4  민엽  90  30   80  100  20  90

In [59]:
df_6.set_index('이름', inplace=True)

In [60]:
df_6

    수학  영어   음악   체육  국어  과학
이름
서준  90  98   85  100  10  10
우현  80  89   95   90  10  20
인아  70  95  100   90  10  30
민엽  90  30   80  100  20  90

In [63]:
df_6.loc['민엽']['체육'] =50

In [64]:
df_6.loc['민엽','음악'] =50

In [67]:
df_6.loc['민엽'][['체육','음악']] =60

In [70]:
df_6.loc['민엽',['음악','수학']] =0

In [73]:
df_6.loc['민엽',['음악','수학']] = [30,40]

In [75]:
df_6.loc['민엽',['음악','수학']] = 50, 60

In [76]:
df_6

    수학  영어   음악   체육  국어  과학
이름
서준  90  98   85  100  10  10
우현  80  89   95   90  10  20
인아  70  95  100   90  10  30
민엽  60  30   50   60  20  90

In [79]:
df_7 = df_6.transpose()

In [81]:
df_7.T

    수학  영어   음악   체육  국어  과학
이름
서준  90  98   85  100  10  10
우현  80  89   95   90  10  20
인아  70  95  100   90  10  30
민엽  60  30   50   60  20  90

In [85]:
df_6.reset_index(inplace=True)

In [89]:
df_6.set_index('이름',inplace=True)

In [93]:
df_6.set_index(['영어','과학'],inplace=True)

In [105]:
df_7 = df_7.T

In [108]:
df_7.reset_index(inplace=True)

# 정렬

In [112]:
df_7.sort_values('수학') #오름차순

   이름  수학  영어   음악   체육  국어  과학
3  민엽  60  30   50   60  20  90
2  인아  70  95  100   90  10  30
1  우현  80  89   95   90  10  20
0  서준  90  98   85  100  10  10

In [113]:
df_7.sort_values('수학',ascending=False) #내림차순

   이름  수학  영어   음악   체육  국어  과학
0  서준  90  98   85  100  10  10
1  우현  80  89   95   90  10  20
2  인아  70  95  100   90  10  30
3  민엽  60  30   50   60  20  90

# 사칙 연산

In [115]:
stud_1 = pd.Series({'수학':10, "영어":20, "음악":30})

In [117]:
stud_1

수학    10
영어    20
음악    30
dtype: int64

In [118]:
stud_1 + 1

수학    11
영어    21
음악    31
dtype: int64

In [119]:
stud_1 - 1

수학     9
영어    19
음악    29
dtype: int64

In [128]:
stud_1 * 2

수학    20
영어    40
음악    60
dtype: int64

In [122]:
stud_1/2

수학     5.0
영어    10.0
음악    15.0
dtype: float64

In [123]:
stud_2 = pd.Series({'수학':20, "영어":50, "음악":20})

In [124]:
stud_2 + stud_1

수학    30
영어    70
음악    50
dtype: int64

In [125]:
stud_2 - stud_1

수학    10
영어    30
음악   -10
dtype: int64

In [126]:
stud_2 * stud_1

수학     200
영어    1000
음악     600
dtype: int64

In [127]:
stud_2 / stud_1

수학    2.000000
영어    2.500000
음악    0.666667
dtype: float64

In [129]:
import numpy as np

In [133]:
pd.DataFrame(np.array(df_7))

    0   1   2    3    4   5   6
0  서준  90  98   85  100  10  10
1  우현  80  89   95   90  10  20
2  인아  70  95  100   90  10  30
3  민엽  60  30   50   60  20  90

In [134]:
arr_1 = np.array([[1,2,3],
         [4,5,6],
         [7,8,9]])

In [135]:
pd.DataFrame(arr_1)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

# not a number (nan)

In [139]:
type(np.nan)

float

In [140]:
np.nan?

Type:        float
String form: nan
Docstring:   Convert a string or number to a floating point number, if possible.

In [141]:
stud_1 = pd.Series({'수학':np.nan, "영어":20, "음악":30
})
stud_2 = pd.Series({'수학':20, "음악":20
})

In [142]:
stud_1

수학     NaN
영어    20.0
음악    30.0
dtype: float64

In [143]:
stud_2

수학    20
음악    20
dtype: int64

In [144]:
stud_1 + stud_2

수학     NaN
영어     NaN
음악    50.0
dtype: float64

In [146]:
stud_1.add(stud_2, fill_value=10)

수학    30.0
영어    30.0
음악    50.0
dtype: float64